{"fiverr": {"description": "\nWhat’s the job?\nFiverr is looking for Software Engineering Graduates to join our R&D team.\n\nAre you interested in working on huge-scale web products and features that get used by millions of people? Are you passionate about working with cutting-edge technologies and solving interesting challenges? Are you interested in learning from talented and professional engineers? Are you tech-savvy and a doer?\n\nIf yes, your place is with us!\n\nWhat am I going to do?\nDesign and architecture of modules and services.\nDevelopment of products and features.\nEnd to End ownership - from design until production.\nWhat are the qualifications?\nBSc./MSc. in Computer Science or a related technical discipline from a leading university - must!\nExcellent CS and analytical skills.\nStrong interpersonal skills and a great teammate.\nAbility to work in a fast paced environment.\nUnderstanding of database environments - an advantage.\nUnderstanding of modern web applications architecture and design - an advantage.\nKotlin, Ruby, Nodejs ,GO - an advantage.\nWorking in large scale system development - an advantage.\nFluent English.\n", "keywords": ["Software Engineering", "R&D", "huge-scale web products", "cutting-edge technologies", "Design", "architecture", "Development", "End to End ownership", "BSc", "MSc", "Computer Science", "Excellent CS skills", "analytical skills", "Strong interpersonal skills", "team player", "fast-paced environment", "database environments", "modern web applications architecture", "Kotlin", "Ruby", "Nodejs", "GO", "large scale system development", "Fluent English"], "job_type": "backend", "bio": "Adjusted bio:  \n\"Highly motivated individual with a keen interest in Software Engineering and cutting-edge technologies. Equipped with solid interpersonal skills and a passion for solving analytical challenges, I’m eager to contribute to a high-performing R&D team working on huge-scale web products in a fast-paced environment. Dedicated to leveraging my knowledge and skill-set by providing impactful solutions.\""}, "insait": {"description": "\nAbout Us:\n\nInsait IO is reshaping the banking, insurance, and fintech scenes with advanced predictive technology and proactive LLMs. We focus on crafting smart, data-driven strategies for maximum engagement. Our approach includes real-time analytics that redefine marketing, and a sales bot that simplifies the financial product selection process, offering a seamless and automated experience for everything from loans to insurance.\n\n\nRole Overview:\n\nWe are seeking a motivated and talented intern with a background in Data Science (DS) and a strong proficiency in Python, NumPy, and Pandas. The ideal candidate will have experience with Large Language Models (LLMs), including concepts such as transformers and training, and familiarity with OpenAI, Claude, and Gemini APIs. Additionally, a significant advantage will be given to candidates with backend development experience using Flask, demonstrating the ability to build, deploy, and maintain web applications. This role offers an excellent opportunity to work on cutting-edge projects, integrating data science with robust backend solutions.\n\n\nKey Responsibilities:\n\nDevelop and optimize LLMs\nBuild LLM-based analytics\nIntegrate and utilize APIs from OpenAI, Claude, and Gemini\nConnect user-LLM interaction interfaces and models\n\n\nRequirements:\n\nStrong experience in Data Science with Python, NumPy, and Pandas\nKnowledge of LLM concepts, including transformers and training techniques\nFamiliarity with OpenAI, Claude, and Gemini APIs\nExcellent problem-solving skills and a proactive attitude\nStrong communication and teamwork abilities\n\n\nWhat We Offer:\n\nHands-on experience with advanced AI technologies\nMentorship from experienced AI professionals\nOpportunity to contribute to impactful projects\n", "keywords": ["Data Science", "Python", "NumPy", "Pandas", "Large Language Models", "LLM", "transformers", "training", "OpenAI", "Claude", "Gemini APIs", "Flask", "backend development", "web applications", "optimize LLMs", "LLM-based analytics", "user-LLM interaction", "problem-solving skills", "communication skills", "teamwork skills"], "job_type": "ML", "bio": "Highly motivated individual with a keen interest in Data Science and Large Language Models. Equipped with solid communication skills and a passion for problem-solving, I’m eager to contribute to a high-performing team in a fast-paced, technology-driven environment. Dedicated to continuing leveraging my knowledge and skill-set by providing impactful solutions in the fintech and banking sectors."}, "mobileye": {"description": "\nYou will be part of Mobileye's REM (Road Experience Management) department which is responsible for the automatic High-Definition map-making process, which is a key technology in Mobileye's autonomous driving and high-end Driving Assistance systems.\nVision based localization is a key enabler in utilizing and creating the map. We develop algorithms that align the map with the world.\n\nYou are welcome to read more on our product here\nWhat will your job look like:\nMathematical modeling and abstraction of real-life problems.\nResearch, design and develop innovative algorithmic solutions.\nCode design, implementation, and hands-on development.\nYour job will include a combination of classic programming and algorithm development.\nYou will need to both maintain the product and develop new features.\n\nAll you need is:\nComputer Science/Computer Engineering/Mathematics/Physics outstanding graduate with highest honors from leading institutions.\nMSc - advantage.\nOutstanding mathematical capabilities.\nOutstanding coding capabilities C++/Python.\nCapable of self-learning.\nBackground in computer vision - advantage\n", "keywords": ["HD map-making", "autonomous driving", "Driving Assistance systems", "vision based localization", "mathematical modeling", "algorithm development", "C++", "Python", "computer science", "computer engineering", "mathematics", "physics", "MSc", "self-learning", "computer vision"], "job_type": "ML", "bio": "**Adjusted Bio:**\n\nHighly motivated individual with a keen interest in Machine Learning and algorithmic solutions, particularly in the field of autonomous driving and high-end Driving Assistance systems. Equipped with solid communication skills and a passion for mathematical modeling and problem-solving. I’m eager to contribute to a high-performing team in a fast-paced, technology-driven environment. Dedicated to continuing leveraging my knowledge and skill-set by providing impactful solutions."}, "insait backend": {"description": "\nAbout Us:\n\n\n\nInsait IO is at the forefront of revolutionizing the banking, insurance, and fintech industries with our advanced predictive technology and proactive LLMs. We specialize in creating intelligent, data-driven strategies that drive maximum engagement. Our suite of services includes real-time analytics that transform marketing efforts and a sales bot that simplifies financial product selection, providing an automated experience for everything from loans to insurance.\n\nRole Overview:\n\nWe are seeking a motivated and talented intern with a strong background in backend development and experience in building and maintaining web applications. The ideal candidate will have a keen interest in Data Science (DS) and proficiency in Python, Flask, PostgreSQL, Docker, and API integrations. This role offers an excellent opportunity to work on cutting-edge projects, integrating backend solutions with advanced AI technologies.\n\nKey Responsibilities:\n\n\n\nDevelop and maintain backend systems using Flask\nIntegrate and optimize APIs, including OpenAI, Claude, and Gemini\nDesign and manage databases using PostgreSQL\nImplement Docker and Docker Compose for application deployment\nWrite and maintain tests using pytest\nCollaborate with front-end developers and data scientists to connect user interfaces with backend models\nMaintain code quality and version control using GitHub\n\n\nRequirements:\n\n\n\nStrong experience in backend development with Python and Flask\nProficiency in PostgreSQL for database management\nExperience with Docker and Docker Compose\nKnowledge of API integration and optimization\nFamiliarity with testing frameworks, especially pytest\nExcellent problem-solving skills and a proactive attitude\nStrong communication and teamwork abilities\n\n\nWhat We Offer:\n\n\n\nHands-on experience with advanced backend technologies and AI integration\nMentorship from experienced professionals in the tech industry\nOpportunity to contribute to impactful projects that reshape industries\n\n", "keywords": ["Python", "Flask", "PostgreSQL", "Docker", "API integrations", "backend development", "Data Science", "OpenAI", "Claude", "Gemini", "Docker Compose", "pytest", "GitHub", "database management", "API optimization", "testing frameworks", "problem-solving skills", "communication skills", "teamwork abilities", "AI technologies"], "job_type": "backend", "bio": "Adjusted bio: Highly motivated individual with a keen interest in Data Science and backend development. Equipped with solid communication skills and a passion for problem-solving, I’m eager to contribute to a high-performing team in a fast-paced, technology-driven environment. Dedicated to continuing to leverage my knowledge and skill-set by providing impactful solutions, especially in the fintech and AI sectors."}, "mastercard": {"description": "\nOur Purpose\n\nWe work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\n\nTitle And Summary\n\nJunior Data Engineer\n\nOverview\n\n Responsible for the analysis, design, development and delivery of software solutions\n Defines requirements for new applications and customizations, adhering to standards, processes and best practices\n\n\nRole\n\n Own software delivery tasks (code development, test, deployment) at an application/software component level\n Participate in team prioritization discussions with Product/Business stakeholders\n Able to troubleshoot and architecture patterns needed for the work\n Influence the decisions made by the team\n Assist peers and less experiences members\n Demonstrate active learning and sharing of software practices via Guild/Engineering community initiatives\n Assist in technical documentation of APIs and services being delivered\n\n\nExperience\n\n Has ability to write secure code in three or more languages\n Familiar with secure coding standards\n Understands and implements standard branching (e.g., Gitflow) and peer review practices\n Understands and builds test code at unit level, service level, and integration level to ensure code and functional coverage\n Understands the use of basic design patterns\n Understands requirement analysis being essential part of delivering value to our customers and partners and participate in elaboration, prioritization, and effort estimation\n Understands different SDLC practices (Waterfall/Scrum/Kanban/SAFe) and the delivery situations they are used for\n Understands the basic engineering principles used in building and running mission critical software capabilities (security, customer experience, testing, operability, simplification, service-oriented architecture)\n Familiar with different application patterns to implement different types of business processes\n Understands Continuous Integration (CI) and Delivery (CD) concepts, and capabilities to support automation, pipelines, virtualization, and containerization\n Has ability to write code to build automation tasks that are repeatable and efficient\n Understands functional and non-functional testing types to elaborate and estimate test efforts\n\n\nCorporate Security Responsibility\n\n All activities involving access to Mastercard assets, information, and networks comes with an inherent risk to the organization and, therefore, it is expected that every person working for, or on behalf of, Mastercard is responsible for information security and must:\n\nAbide by Mastercard’s security policies and practices;\nEnsure the confidentiality and integrity of the information being accessed;\nReport any suspected information security violation or breach, and\nComplete all periodic mandatory security trainings in accordance with Mastercard’s guidelines.\n\n", "keywords": ["data engineer", "software solutions", "application development", "software delivery", "code development", "test", "deployment", "software component", "product/business stakeholder collaboration", "troubleshooting", "architecture patterns", "technical decision influence", "peer assistance", "software practice sharing", "technical documentation", "API documentation", "secure coding", "multiple programming languages", "coding standards", "Gitflow", "peer review", "unit testing", "service testing", "integration testing", "design patterns", "requirement analysis", "SDLC", "Waterfall", "Scrum", "Kanban", "SAFe", "engineering principles", "mission critical software", "security", "customer experience", "testing", "operability", "simplification", "service-oriented architecture", "business process implementation", "Continuous Integration (CI)", "Continuous Delivery (CD)", "automation", "pipelines", "virtualization", "containerization", "automation coding", "functional testing", "non-functional testing", "test effort estimation", "information security", "security policy adherence", "confidentiality", "integrity", "security training"], "job_type": "data engineer", "bio": "Adjusted bio:\n---\n\nHighly motivated individual with a keen interest in data engineering and secure coding practices. Equipped with solid communication skills and a passion for problem-solving, I’m eager to contribute to a high-performing team in a fast-paced, technology-driven environment. Dedicated to leveraging my knowledge in secure coding standards and continuous integration/delivery to provide impactful solutions."}}