{"fiverr": {"description": "\nWhat’s the job?\nFiverr is looking for Software Engineering Graduates to join our R&D team.\n\nAre you interested in working on huge-scale web products and features that get used by millions of people? Are you passionate about working with cutting-edge technologies and solving interesting challenges? Are you interested in learning from talented and professional engineers? Are you tech-savvy and a doer?\n\nIf yes, your place is with us!\n\nWhat am I going to do?\nDesign and architecture of modules and services.\nDevelopment of products and features.\nEnd to End ownership - from design until production.\nWhat are the qualifications?\nBSc./MSc. in Computer Science or a related technical discipline from a leading university - must!\nExcellent CS and analytical skills.\nStrong interpersonal skills and a great teammate.\nAbility to work in a fast paced environment.\nUnderstanding of database environments - an advantage.\nUnderstanding of modern web applications architecture and design - an advantage.\nKotlin, Ruby, Nodejs ,GO - an advantage.\nWorking in large scale system development - an advantage.\nFluent English.\n", "keywords": ["Software Engineering", "R&D", "huge-scale web products", "cutting-edge technologies", "Design", "architecture", "Development", "End to End ownership", "BSc", "MSc", "Computer Science", "Excellent CS skills", "analytical skills", "Strong interpersonal skills", "team player", "fast-paced environment", "database environments", "modern web applications architecture", "Kotlin", "Ruby", "Nodejs", "GO", "large scale system development", "Fluent English"], "job_type": "backend", "bio": "Adjusted bio:  \n\"Highly motivated individual with a keen interest in Software Engineering and cutting-edge technologies. Equipped with solid interpersonal skills and a passion for solving analytical challenges, I’m eager to contribute to a high-performing R&D team working on huge-scale web products in a fast-paced environment. Dedicated to leveraging my knowledge and skill-set by providing impactful solutions.\""}, "insait": {"description": "\nAbout Us:\n\nInsait IO is reshaping the banking, insurance, and fintech scenes with advanced predictive technology and proactive LLMs. We focus on crafting smart, data-driven strategies for maximum engagement. Our approach includes real-time analytics that redefine marketing, and a sales bot that simplifies the financial product selection process, offering a seamless and automated experience for everything from loans to insurance.\n\n\nRole Overview:\n\nWe are seeking a motivated and talented intern with a background in Data Science (DS) and a strong proficiency in Python, NumPy, and Pandas. The ideal candidate will have experience with Large Language Models (LLMs), including concepts such as transformers and training, and familiarity with OpenAI, Claude, and Gemini APIs. Additionally, a significant advantage will be given to candidates with backend development experience using Flask, demonstrating the ability to build, deploy, and maintain web applications. This role offers an excellent opportunity to work on cutting-edge projects, integrating data science with robust backend solutions.\n\n\nKey Responsibilities:\n\nDevelop and optimize LLMs\nBuild LLM-based analytics\nIntegrate and utilize APIs from OpenAI, Claude, and Gemini\nConnect user-LLM interaction interfaces and models\n\n\nRequirements:\n\nStrong experience in Data Science with Python, NumPy, and Pandas\nKnowledge of LLM concepts, including transformers and training techniques\nFamiliarity with OpenAI, Claude, and Gemini APIs\nExcellent problem-solving skills and a proactive attitude\nStrong communication and teamwork abilities\n\n\nWhat We Offer:\n\nHands-on experience with advanced AI technologies\nMentorship from experienced AI professionals\nOpportunity to contribute to impactful projects\n", "keywords": ["Data Science", "Python", "NumPy", "Pandas", "Large Language Models", "LLM", "transformers", "training", "OpenAI", "Claude", "Gemini APIs", "Flask", "backend development", "web applications", "optimize LLMs", "LLM-based analytics", "user-LLM interaction", "problem-solving skills", "communication skills", "teamwork skills"], "job_type": "ML", "bio": "Highly motivated individual with a keen interest in Data Science and Large Language Models. Equipped with solid communication skills and a passion for problem-solving, I’m eager to contribute to a high-performing team in a fast-paced, technology-driven environment. Dedicated to continuing leveraging my knowledge and skill-set by providing impactful solutions in the fintech and banking sectors."}}